performance/reports/html-report/statistics.json
{
  "GET /booking (Warm-up)" : {
    "transaction" : "GET /booking (Warm-up)",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1736.0,
    "medianResTime" : 1736.0,
    "minResTime" : 1736.0,
    "maxResTime" : 1736.0,
    "pct1ResTime" : 1736.0,
    "pct2ResTime" : 1736.0,
    "pct3ResTime" : 1736.0,
    "throughput" : 0.576036866359447,
    "receivedKBytesPerSec" : 22.111040106566822,
    "sentKBytesPerSec" : 0.07762996831797235
  },
  "GET /booking" : {
    "transaction" : "GET /booking",
    "sampleCount" : 9644,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 110.24222314392357,
    "medianResTime" : 104.0,
    "minResTime" : 80.0,
    "maxResTime" : 1736.0,
    "pct1ResTime" : 117.0,
    "pct2ResTime" : 132.0,
    "pct3ResTime" : 221.0,
    "throughput" : 80.46859355183233,
    "receivedKBytesPerSec" : 3672.5992409395653,
    "sentKBytesPerSec" : 10.844400302883653
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 9645,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 110.4107827890096,
    "medianResTime" : 104.0,
    "minResTime" : 80.0,
    "maxResTime" : 1736.0,
    "pct1ResTime" : 117.0,
    "pct2ResTime" : 132.0,
    "pct3ResTime" : 221.53999999999905,
    "throughput" : 80.47693745410854,
    "receivedKBytesPerSec" : 3672.9195196728356,
    "sentKBytesPerSec" : 10.845524774088846
  }
}